In [1]:
import pandas as pd

### 판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API

pd.read_csv()는 인자로 들어온 파일을 로딩해 DataFrame 객체로 반환

In [6]:
titanic_df = pd.read_csv('datas/titanic_train.csv')
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
print('titanic 변수 type:', type(titanic_df))

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

In [8]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

별다른 파라미터 지정 없으면, 파일의 맨 처음 row를 column 명으로 인지<br>
가장 왼쪽(PassengerId의 왼쪽) 데이터 값들이 판다스의 Index 객체<br>
DataFrame 내의 데이터는 생성되는 순간 고유의 Index 값 부여됨

In [9]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
print('DataFrame 크기:', titanic_df.shape)

DataFrame 크기: (891, 12)

$\rightarrow$ 891개의 row와 12개의 column으로 구성

In [13]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

$\rightarrow$ info() 메서드를 통해 총 데이터 건수, 데이터 타입, Null 건수 확인 가능<br>
(object 타입은 문자열으로 생각하면 됨)

In [14]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

$\rightarrow$ column 별 숫자형 데이터값의 n-percentile 분포도, 평균, 최대, 최소 표시<br>
(object 타입은 제외됨)

데이터의 분포도를 아는 것은 머신러닝 알고리즘 향상시키는 중요 요소<br>
값이 왜곡되어있는지, 이상치 많은지 등 탐색<br>
정확한 분포도를 알기 어렵지만 개략적인 수준의 분포도 확인에 유용

카테고리 column: 성별(1, 2)와 같이 특정 범주에 속하는 값을 코드화한 column

---

DataFrame의 [] 연산자 내부에 column 명 입력시 Series 형태의 특정 column 데이터 세트 반환<br>
반환된 Series 객체에 value_counts() 메서드 호출하면 column 유형과 건수 확인 가능<br>
데이터 분포도 확인에 유용한 함수

In [20]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [17]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [18]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

Series는 Index와 단 하나의 column으로 구성된 데이터 세트

value_counts()가 반환하는 데이터 타입 또한 Series 객체

In [21]:
print(value_counts)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

위 반환된 Series 객체의 값을 보면 인덱스가 단순히 0부터 시작하는 순차값이 아님을 알 수 있음<br>
고유성이 보장된다면 의미 있는 데이터 값 할당도 가능<br>
인덱스는 DataFrame, Series가 만들어진 후에도 변경 가능함, 그리고 숫자뿐만 아니라 문자열도 가능<br>
단, 고유성은 반드시 보장돼야 함

value_counts()는 Null 값을 무시하고 결과값을 내놓기 쉬움<br>
Null 값을 포함할지 dropna 인자로 판단(기본값(True): Null 무시하고 계산)

In [22]:
print('titanic_df 데이터 건수:', titanic_df.shape[0])
print('기본 설정인 dropna=True로 value_counts()')

# value_counts()는 디폴트로 dropna=True이므로 value_counts(dropna=True)와 동일
print(titanic_df['Embarked'].value_counts())
print(titanic_df['Embarked'].value_counts(dropna=False))

titanic_df 데이터 건수: 891
기본 설정인 dropna=True로 value_counts()
Embarked
S    644
C    168
Q     77
Name: count, dtype: int64
Embarked
S      644
C      168
Q       77
NaN      2
Name: count, dtype: int64

### DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환

사이킷런을 위해서 DataFrame과 ndarray 상호 간 변환 매우 빈번히 발생

#### 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

column 명 지정 필요

In [28]:
import numpy as np

col_name1 = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)
print('array1 shape:', array1.shape)
# 리스트를 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)
# 넘파이 ndarray를 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

array1 shape: (3,)
1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

$\rightarrow$ 1차원 데이터 기반은 column명 1개 필요,<br>
2차원 데이터 기반 DataFrame(2행 3열) 형태라면 3개의 column명 필요

In [29]:
# 3개의 column명 필요
col_name2 = ['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2 = [[1, 2, 3],
         [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape)
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:', df_list2)
df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:', df_array2)

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame:    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:    col1  col2  col3
0     1     2     3
1    11    12    13

딕셔너리 변환: 키$\rightarrow$column명, 값$\rightarrow$column 데이터 변환됨<br>
그러므로, 키: 문자열, 값: 리스트(or ndarray) 형태로 딕셔너리 구성

In [31]:
# Key는 문자열 column명으로 매핑, Value는 리스트형(or ndarray) column 데이터로 매핑
dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

#### DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

많은 머신러닝 패키지가 기본 데이터 형으로 넘파이 ndarray 사용<br>
DataFrame $\rightarrow$ ndarray 변환 빈번<br>
DataFrame 객체의 values를 이용해 쉽게 변환 가능

In [33]:
# DataFrame을 ndarray로 변환
array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

DataFrame $\rightarrow$ 리스트, 딕셔너리 변환<br>
리스트로의 변환: values로 얻은 ndarray에 tolist()를 호출<br>
딕셔너리로의 변환: DataFrame 객체 to_dict() 메서드 호출, 인자로 'list' 입력하면 값이 리스트 형으로 반환

In [36]:
# DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

# DataFrame을 딕셔너리로 변환
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

#### DataFrame의 column 데이터 세트 생성과 수정